Revit 2027 API
DocumentOpeningEventArgs.DocumentType Property
 Type of the document, e.g. Project or Template.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DocumentType DocumentType { get; }
Public ReadOnly Property DocumentType As DocumentType
	Get
public:
property DocumentType DocumentType {
	DocumentType get ();
}
member DocumentType : DocumentType with get
Property Value
DocumentType
See Also
Reference
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace